/***********************************************************************************
 * ÎÄ ¼ş Ãû   : kb_dev.c
 * ¸º Ôğ ÈË   : MZM
 * ´´½¨ÈÕÆÚ   : 2016Äê5ÔÂ16ÈÕ
 * ÎÄ¼şÃèÊö   : Òº¾§ÏÔÊ¾²ÎÊı Éè±¸½á¹¹Ìå¼°²Ù×÷ÎÄ¼ş½Ó¿Ú
 * °æÈ¨ËµÃ÷   : Copyright (c) 2008-2016   ±±¾©ÊĞÍò¸ñÊıÂëÍ¨Ñ¶¿Æ¼¼ÓĞÏŞ¹«Ë¾
 * Æä    Ëû   : 
 * ĞŞ¸ÄÈÕÖ¾   : 
***********************************************************************************/

//#include "display.h"
//#include "display.h"

#define KBDEV_GLOBALS

#include "kb_dev.h"


 DISPLAY_KB_P kb_dev = NULL;

/*****************************************************************************
 * º¯ Êı Ãû  : kb_dev_init
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ10ÈÕ
 * º¯Êı¹¦ÄÜ  : °´¼üÉè±¸³õÊ¼»¯£¬ÉêÇëÉè±¸½á¹¹¿Õ¼ä
 * ÊäÈë²ÎÊı  : ÎŞ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : void
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void kb_dev_init()
{
	
	kb_dev=(DISPLAY_KB_P) pvPortMalloc(sizeof(DISPLAY_KB_T));
	if(kb_dev == NULL)
	{
		
	}
	else
	{
		
	}
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_KB_Dev
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡°´¼üÒº¾§ÏÔÊ¾Éè±¸ Ö¸Õë
 * ÊäÈë²ÎÊı  : ÎŞ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
DISPLAY_KB_P Get_KB_Dev()
{
	return kb_dev;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Net_Icon_Dark_Bright
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ÍøÂçÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬ 1 ÁÁ£¬0 °µ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Net_Icon_Dark_Bright(uint8_t state)
{
	kb_dev->state_param.net_state = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Net_Icon_Dark
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ÍøÂçÍ¼±ê  ×´Ì¬---°µ
 * ÊäÈë²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Net_Icon_Dark()
{
	Set_Net_Icon_Dark_Bright(ICON_DARK);
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Net_Icon_Bright
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ÍøÂçÍ¼±ê  ×´Ì¬---ÁÁ
 * ÊäÈë²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Net_Icon_Bright()
{
	Set_Net_Icon_Dark_Bright(ICON_BRIGHT);
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Net_Icon_State
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ ÍøÂçÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  : 0----°µ£¬1----ÁÁ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Net_Icon_State()
{
	return kb_dev->state_param.net_state;
}


/*****************************************************************************
 * º¯ Êı Ãû  : Set_MSC_Icon_Dark_Bright
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ MSCÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_MSC_Icon_Dark_Bright(uint8_t state)
{
	kb_dev->state_param.msc_state = state;
}
/*****************************************************************************
 * º¯ Êı Ãû  : Get_MSC_Icon_State
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ MSCÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  : 0--°µ£¬1--ÁÁ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_MSC_Icon_State()
{
	return kb_dev->state_param.msc_state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_MSC_Icon_Dark_Bright
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ Êı¾İ¿âÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_DBS_Icon_Dark_Bright(uint8_t state)
{
	kb_dev->state_param.dbs_state = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_DBS_Icon_State
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ Êı¾İ¿âÍ¼±ê  ×´Ì¬---ÁÁ»òÕß°µ
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  : uint8_t state  Í¼±ê×´Ì¬  0°µ£¬1ÁÁ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_DBS_Icon_State()
{
	return kb_dev->state_param.dbs_state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Heart_Icon_ON_OFF
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ĞÄÌøÍ¼±ê ¿ª¹Ø
 * ÊäÈë²ÎÊı  : uint8_t state  ¿ª¹Ø×´Ì¬
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Heart_Icon_ON_OFF(uint8_t state)
{
	kb_dev->state_param.heart_state= state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Heart_Icon_State
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ ĞÄÌøÍ¼±ê ¿ª¹Ø
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  : uint8_t state  ¿ª¹Ø×´Ì¬ 
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Heart_Icon_State()
{
	return kb_dev->state_param.heart_state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Ctr_CH_State_1_param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ÇøÓò3µÄ Í¨µÀ×´Ì¬----cch idle  busy
 * ÊäÈë²ÎÊı  : uint8_t state  Í¨µÀ×´Ì¬   0--cch  1 idle  2 busy
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Ctr_CH_State_1_param(uint8_t state)
{
	kb_dev->state_param.ch_state_1= state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Ctr_CH_State_1_param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ ÇøÓò3µÄ Í¨µÀ×´Ì¬----cch idle  busy
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint8_t state  Í¨µÀ×´Ì¬   0--cch  1 idle  2 busy
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Ctr_CH_State_1_param()
{
	return kb_dev->state_param.ch_state_1;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Ctr_CH_State_2_param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ÇøÓò3µÄ Í¨µÀ×´Ì¬----cch idle  busy
 * ÊäÈë²ÎÊı  : uint8_t state  Í¨µÀ×´Ì¬   0--cch  1 idle  2 busy
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Ctr_CH_State_2_param(uint8_t state)
{
	kb_dev->state_param.ch_state_2= state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Ctr_CH_State_1_param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ ÇøÓò3µÄ Í¨µÀ×´Ì¬----cch idle  busy
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint8_t state  Í¨µÀ×´Ì¬   0--cch  1 idle  2 busy
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Ctr_CH_State_2_param()
{
	return kb_dev->state_param.ch_state_2;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_System_ID_Param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : Ö÷¿Ø×´Ì¬ÏÂ-cch   ÉèÖÃ ÇøÓò3µÄ ÏµÍ³id----
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_System_ID_Param(uint16_t state)
{
	kb_dev->state_param.sys_id = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_System_ID_Param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : Ö÷¿Ø×´Ì¬ÏÂ-cch    ¶ÁÈ¡ ÇøÓò3µÄ ÏµÍ³id----
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint16_t Get_System_ID_Param()
{
	return kb_dev->state_param.sys_id;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Call_Timer_Param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ºô½Ğ¼ÆÊ±Æ÷²ÎÊı
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Call_Timer_Param(uint16_t state)
{
	kb_dev->state_param.call_timer = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Call_Timer_Param
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ¶ÁÈ¡ ºô½Ğ¼ÆÊ±Æ÷
 * ÊäÈë²ÎÊı  :
 * Êä³ö²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint16_t Get_Call_Timer_Param()
{
	return kb_dev->state_param.call_timer;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Comm_param_Work_Mode
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ¹¤×÷Ä£Ê½å-- DMR/PDT/mpt/
 * ÊäÈë²ÎÊı  : 0-dmr/1-pdt/2-mpt
 * Êä³ö²ÎÊı  :  uint8_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Comm_param_Work_Mode(uint8_t state)
{
	kb_dev->communicate_param.work_mode = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Comm_param_Work_Mode
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ¶ÁÈ¡ ¹¤×÷Ä£Ê½å-- DMR/PDT/mpt/
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  :  uint8_t state  £»0-dmr/1-pdt/2-mpt
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Comm_param_Work_Mode()
{
	return kb_dev->communicate_param.work_mode;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Comm_param_Work_Mode1
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ¹¤×÷Ä£Ê½å-- DMR/PDT/mpt/
 * ÊäÈë²ÎÊı  : 0-dmr/1-pdt/2-mpt
 * Êä³ö²ÎÊı  :  uint8_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Comm_param_Work_Mode1(uint8_t state)
{
	kb_dev->communicate_param.work_mode_1 = state;
}
/*****************************************************************************
 * º¯ Êı Ãû  : Get_Comm_param_Work_Mode
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : »ñÈ¡ ¹¤×÷Ä£Ê½å-- DMR/PDT/mpt/
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  :  uint8_t state  £»0-dmr/1-pdt/2-mpt
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint8_t Get_Comm_param_Work_Mode1()
{
	return kb_dev->communicate_param.work_mode_1;
}


/*****************************************************************************
 * º¯ Êı Ãû  : Set_Comm_param_CH_No
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ Í¨µÀºÅ
 * ÊäÈë²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * Êä³ö²ÎÊı  : 
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Comm_param_CH_No(uint16_t state)
{
	kb_dev->communicate_param.ch_no = state;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Comm_param_CH_No
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ¶ÁÈ¡ Í¨µÀºÅ
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  :  uint8_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint16_t Get_Comm_param_CH_No()
{
	return kb_dev->communicate_param.ch_no;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Comm_param_Tx_Freq
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ·¢ÉäÆµÂÊ
 * ÊäÈë²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * Êä³ö²ÎÊı  : 
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Comm_param_Tx_Freq(uint32_t freq)
{
	kb_dev->communicate_param.tx_freq = freq;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Comm_param_Tx_Freq
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ¶ÁÈ¡ ·¢ÉäÆµÂÊ
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  :  uint8_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint32_t Get_Comm_param_Tx_Freq()
{
	return kb_dev->communicate_param.tx_freq;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Set_Comm_param_Rx_Freq
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ ½ÓÊÕÆµÂÊ
 * ÊäÈë²ÎÊı  :  uint16_t state  16½øÖÆÊı£»
 * Êä³ö²ÎÊı  : 
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void Set_Comm_param_Rx_Freq(uint32_t freq)
{
	kb_dev->communicate_param.rx_freq = freq;
}

/*****************************************************************************
 * º¯ Êı Ãû  : Get_Comm_param_Rx_Freq
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ¶ÁÈ¡ ¶ÁÈ¡ÆµÂÊ
 * ÊäÈë²ÎÊı  : 
 * Êä³ö²ÎÊı  :  uint8_t state  16½øÖÆÊı£»
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
uint32_t Get_Comm_param_Rx_Freq()
{
	return kb_dev->communicate_param.rx_freq;
}

/*****************************************************************************
 * º¯ Êı Ãû  : kb_save_work_mode
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ±£´æ ¹¤×÷Ä£Ê½--¹¤×÷Ä£Ê½1(dmr/pdt/mpt),¹¤×÷Ä£Ê½1(repeat,trunk,..)
 * ÊäÈë²ÎÊı  : 	uint8_t work_mode, dmr/pdt/mpt
 				uint8_t work_mode_1 repeat,trunk
 * Êä³ö²ÎÊı  : 
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void kb_save_work_mode(uint8_t work_mode,uint8_t work_mode_1)
{
	Set_Comm_param_Work_Mode(work_mode);	//±£´æ¹¤×÷Ä£Ê½
	Set_Comm_param_Work_Mode1(work_mode_1);	//±£´æ¹¤×÷Ä£Ê½1
	
}

/*****************************************************************************
 * º¯ Êı Ãû  : kb_save_ch_no_txrx_freq
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃĞÅµÀºÅ£¬·¢Éä¡¢½ÓÊÕÆµÂÊ£¬ĞÅµÀÄ£Ê½Îªpdt+trunk£¬Í¨µÀºÅ¼´ÎªÆµ
               ÂÊ±àºÅ
 * ÊäÈë²ÎÊı  : uint16_t chnum    ĞÅµÀºÅ
               uint32_t tx_freq  ·¢ÉäÆµÂÊ
               uint32_t rx_freq  ½ÓÊÕÆµÂÊ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void kb_save_ch_no_txrx_freq(uint16_t chnum,uint32_t tx_freq,uint32_t rx_freq)
{
	uint32_t freq;
	
	Set_Comm_param_CH_No(chnum);		//±£´æ ĞÅµÀºÅ
	if(is_work_mode_CH_No_freq() == TRUE)
	{
		/* ĞÅµÀºÅ--ÆµÂÊ±àºÅ: chnum *12.5K +348M */
 		freq = CH_no_2_Freq(chnum);	
	
		Set_Comm_param_Rx_Freq(freq);
		// TXÆµÂÊ ±È RX ÆµÂÊ¶à10M
		freq += 10*1000;
		Set_Comm_param_Tx_Freq(freq);
	}
	else
	{
		Set_Comm_param_Rx_Freq(rx_freq);
		Set_Comm_param_Tx_Freq(tx_freq);
	}
	
	return;
}


void kb_save_ctr_ch_state(uint8_t stateno,uint8_t ch_state_value,uint16_t sys_id)
{
	/*¸ù¾İ×´Ì¬À¸ºÅ£¬À´±£´æ×´Ì¬Öµ£¬0--µÚÒ»¸ö×´Ì¬À¸£¬1--µÚ¶ş¸ö×´Ì¬À¸*/
	if(stateno == 0)
	{
		Set_Ctr_CH_State_1_param( ch_state_value);
	}
	else
	{
		Set_Ctr_CH_State_2_param( ch_state_value);
	}

	/* Ö÷¿Ø sysid==ÏµÍ³id£¬·ÇÖ÷¿ØÄ£Ê½:sysid==µ¹¼ÆÊ±³¤*/
	if(ch_state_value == CTR_CH_STATE_MAIN)
	{
		Set_System_ID_Param(sys_id);
	}
	else
	{
		Set_Call_Timer_Param( sys_id);
	}

}

/*****************************************************************************
 * º¯ Êı Ãû  : kb_save_ctr_ch_state1_main
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ¿ØÖÆĞÅµÀ×´Ì¬£ºÖ÷¿ØĞÅµÀ--sysid Îªsystemid£¬ÆäËûÎªcalltimer
 * ÊäÈë²ÎÊı  : uint8_t ch_state_value  Í¨µÀ×´Ì¬
               uint16_t sys_id   ÏµÍ³id»òÕßcalltimer
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void kb_save_ctr_ch_state1_main(uint8_t ch_state_value,uint16_t sys_id)
{
	kb_save_ctr_ch_state(0,ch_state_value,sys_id);
}

/*****************************************************************************
 * º¯ Êı Ãû  : kb_save_ctr_ch_state2_main
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : ÉèÖÃ¿ØÖÆĞÅµÀ2 ×´Ì¬
 * ÊäÈë²ÎÊı  : uint8_t ch_state     Í¨µÀ×´Ì¬
               uint16_t call_timer  ºô½Ğ¼ÆÊ±Æ÷²ÎÊı
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void kb_save_ctr_ch_state2_main(uint8_t ch_state_value,uint16_t call_timer)
{
	kb_save_ctr_ch_state(1,ch_state_value,call_timer);
}

/*****************************************************************************
 * º¯ Êı Ãû  : KB_OLED_App_init
 * ¸º Ôğ ÈË  : MZM
 * ´´½¨ÈÕÆÚ  : 2016Äê5ÔÂ16ÈÕ
 * º¯Êı¹¦ÄÜ  : °´¼üÒº¾§ÏÔÊ¾Ó¦ÓÃ³õÊ¼»¯£¬ÉÏµçÊ± Òº¾§ÏÔÊ¾½çÃæµÈĞÅÏ¢
 * ÊäÈë²ÎÊı  : ÎŞ
 * Êä³ö²ÎÊı  : ÎŞ
 * ·µ »Ø Öµ  : 
 * µ÷ÓÃ¹ØÏµ  : 
 * Æä    Ëü  : 

*****************************************************************************/
void KB_OLED_App_init()
{
	/*    Ä¬ÈÏÍ¼±ê³õÊ¼»¯   */
	Set_Heart_Icon_ON_OFF(STATE_DISABLE);	//
	Set_Net_Icon_Dark_Bright(ICON_DARK);
	Set_MSC_Icon_Dark_Bright(ICON_DARK);
	Set_DBS_Icon_Dark_Bright(ICON_DARK);
//	Set_Main_Ctr_Icon_Dark_Bright(ICON_DARK);

	/*   Ä¬ÈÏÄ£Ê½¼°ÆµÂÊ    */
//	kb_save_pdt_trunk_chnum(428);	//ÉèÖÃpdtÄ£Ê½¡¢¼¯ÈºÄ£Ê½£¬ÆµÂÊ±àºÅ 355
	kb_save_dmr_repeat_chnum(2,419375,409375);

	/*	Ä¬ÈÏ×´Ì¬ÏÔÊ¾        */
//	kb_save_ctr_ch_state1_main(CTR_CH_STATE_MAIN,0xB1F1);
	kb_save_ctr_ch_state1_main(CTR_CH_STATE_IDLE,180);
	kb_save_ctr_ch_state2_main(CTR_CH_STATE_IDLE,180);
}

